'''Задание 12, 1 Уровень, 1 ЛР
12. Вычислить при заданном х сумму s = 1 + 1/x + 1/x^2 + ... + 1/х^10.'''

x = int(input('Введите x: '))
s = 0
for i in range(11):
    s += 1/(x**i)
    print(s)

print(round(s, 3))